Repository: CaiBai-Fish/forza-gallery-sync
Catalog: web/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# MainWindow_Title_00.Title
source: Forza Gallery Sync Console
zh_cn: Forza Gallery Sync 控制台

# MainWindow_Content_00.Content
source: Library
zh_cn: 图库

# MainWindow_Content_01.Content
source: Overview
zh_cn: 总览

# MainWindow_Content_02.Content
source: Photos
zh_cn: 照片库

# MainWindow_Content_03.Content
source: Tasks
zh_cn: 任务

# MainWindow_Content_04.Content
source: Sync
zh_cn: 同步

# MainWindow_Content_05.Content
source: Settings
zh_cn: 设置

# MainWindow_Content_06.Content
source: Not signed in
zh_cn: 未登录

# MainWindow_Tooltip_00.ToolTipService.ToolTip
source: Open Settings to configure the token
zh_cn: 点击前往设置页配置 Token

# DashboardPage_Text_00.Text
source: Overview
zh_cn: 总览

# DashboardPage_Text_01.Text
source: Statistics for synced photos. Sync options and account settings live in the Sync and Settings pages.
zh_cn: 已同步照片的统计概览；同步参数与账号配置在「同步」「设置」页。

# DashboardPage_Tooltip_00.ToolTipService.ToolTip
source: Reload statistics
zh_cn: 重新加载统计

# DashboardPage_Text_02.Text
source: Refresh
zh_cn: 刷新

# DashboardPage_Text_03.Text
source: Go to Sync
zh_cn: 前往同步

# DashboardPage_Title_00.Title
source: Failed to load statistics
zh_cn: 加载统计失败

# DashboardPage_Title_01.Title
source: Account not ready
zh_cn: 账号尚未就绪

# DashboardPage_Content_00.Content
source: Go to Settings
zh_cn: 前往设置

# DashboardPage_Text_04.Text
source: Total photos
zh_cn: 照片总量

# DashboardPage_Text_05.Text
source: Last sync
zh_cn: 最近同步

# DashboardPage_Text_06.Text
source: Browse library
zh_cn: 浏览照片库

# DashboardPage_Text_07.Text
source: By game
zh_cn: 按游戏分布

# DashboardPage_Text_08.Text
source: No photos yet — run a sync first
zh_cn: 暂无照片记录，先执行一次同步

# DashboardPage_Text_09.Text
source: Last sync
zh_cn: 最近同步

# DashboardPage_Text_10.Text
source: No sync history yet
zh_cn: 还没有同步记录

# DashboardPage_Text_11.Text
source: Latest photos
zh_cn: 最新照片

# DashboardPage_Content_01.Content
source: View all
zh_cn: 查看全部

# DashboardPage_Text_12.Text
source: Copy image
zh_cn: 复制图片

# DashboardPage_Text_13.Text
source: Open with default app
zh_cn: 用默认应用打开

# DashboardPage_Text_14.Text
source: Open containing folder
zh_cn: 打开所在文件夹

# DashboardPage_Text_15.Text
source: Untitled
zh_cn: {x:Bind Title, FallbackValue='无标题'}

# DashboardPage_Text_16.Text
source: Latest photos will appear here after a sync
zh_cn: 同步后这里会显示最新的照片

# DashboardPage_Tooltip_01.ToolTipService.ToolTip
source: Close preview
zh_cn: 关闭预览

# DashboardPage_Text_17.Text
source: Copy image
zh_cn: 复制图片

# DashboardPage_Text_18.Text
source: Open with default app
zh_cn: 用默认应用打开

# DashboardPage_Text_19.Text
source: Open containing folder
zh_cn: 打开所在文件夹

# DashboardPage_Text_20.Text
source: Copy image
zh_cn: 复制图片

# DashboardPage_Text_21.Text
source: Open with default app
zh_cn: 用默认应用打开

# GalleryPage_Tooltip_00.ToolTipService.ToolTip
source: Back to library
zh_cn: 返回照片库

# GalleryPage_PlaceholderText_00.PlaceholderText
source: Search title / ID / game
zh_cn: 搜索标题 / ID / 游戏

# GalleryPage_PlaceholderText_01.PlaceholderText
source: All games
zh_cn: 全部游戏

# GalleryPage_PlaceholderText_02.PlaceholderText
source: All months
zh_cn: 全部月份

# GalleryPage_Tooltip_01.ToolTipService.ToolTip
source: Refresh
zh_cn: 刷新

# GalleryPage_Tooltip_02.ToolTipService.ToolTip
source: Open the download folder in File Explorer
zh_cn: 在资源管理器中打开下载目录

# GalleryPage_Text_00.Text
source: Untitled
zh_cn: {x:Bind Title, FallbackValue='无标题'}

# GalleryPage_Text_01.Text
source: View details
zh_cn: 查看详情

# GalleryPage_Text_02.Text
source: Copy image
zh_cn: 复制图片

# GalleryPage_Text_03.Text
source: Open with default app
zh_cn: 用默认应用打开

# GalleryPage_Text_04.Text
source: Open containing folder
zh_cn: 打开所在文件夹

# GalleryPage_Text_05.Text
source: No photos found
zh_cn: 没有找到照片

# GalleryPage_Text_06.Text
source: Try different filters, or go to the Sync page to fetch photos.
zh_cn: 换个筛选条件，或先前往「同步」页拉取照片。

# GalleryPage_Tooltip_03.ToolTipService.ToolTip
source: Previous page
zh_cn: 上一页

# GalleryPage_Tooltip_04.ToolTipService.ToolTip
source: Next page
zh_cn: 下一页

# GalleryPage_Text_07.Text
source: Copy image
zh_cn: 复制图片

# GalleryPage_Text_08.Text
source: Open with default app
zh_cn: 用默认应用打开

# GalleryPage_Text_09.Text
source: Open containing folder
zh_cn: 打开所在文件夹

# GalleryPage_Tooltip_05.ToolTipService.ToolTip
source: Show / hide photo details
zh_cn: 显示 / 收起照片信息

# GalleryPage_Text_10.Text
source: Uploaded
zh_cn: 上传时间

# GalleryPage_Text_11.Text
source: Downloaded
zh_cn: 下载时间

# GalleryPage_Text_12.Text
source: Photo ID
zh_cn: 照片 ID

# GalleryPage_Text_13.Text
source: Local path
zh_cn: 本地路径

# GalleryPage_Text_14.Text
source: Description
zh_cn: 描述

# GalleryPage_Text_15.Text
source: Copy image
zh_cn: 复制图片

# GalleryPage_Text_16.Text
source: Open with default app
zh_cn: 用默认应用打开

# SettingsPage_Text_00.Text
source: Settings
zh_cn: 设置

# SettingsPage_Text_01.Text
source: Global configuration for account, storage, network and concurrency.
zh_cn: 账号登录、存储位置、网络与并发等全局配置。

# SettingsPage_Text_02.Text
source: Account and token
zh_cn: 账号与 Token

# SettingsPage_Text_03.Text
source: Sign in with browser
zh_cn: 浏览器一键登录

# SettingsPage_Text_04.Text
source: Refresh token
zh_cn: 刷新 Token

# SettingsPage_Text_05.Text
source: Sign in to your Xbox / Microsoft account in the popup window (two-step verification supported). The token is saved automatically.
zh_cn: 在弹出窗口中登录 Xbox / Microsoft 账号（支持两步验证），登录成功后 Token 会自动保存。

# SettingsPage_Text_06.Text
source: Storage
zh_cn: 存储

# SettingsPage_Text_07.Text
source: Download folder
zh_cn: 下载目录

# SettingsPage_Text_08.Text
source: Choose…
zh_cn: 选择…

# SettingsPage_Text_09.Text
source: Database
zh_cn: 数据库

# SettingsPage_Text_10.Text
source: Config file
zh_cn: 配置文件

# SettingsPage_Text_11.Text
source: Network and concurrency
zh_cn: 网络与并发

# SettingsPage_Text_12.Text
source: Page size
zh_cn: 每页数量

# SettingsPage_Text_13.Text
source: Pagination mode
zh_cn: 分页方式

# SettingsPage_Text_14.Text
source: Concurrent threads
zh_cn: 并发线程数

# SettingsPage_Text_15.Text
source: Retry attempts
zh_cn: 失败重试次数

# SettingsPage_Text_16.Text
source: Timeout (seconds)
zh_cn: 超时（秒）

# SettingsPage_Header_00.Header
source: Verify SSL certificates
zh_cn: 验证 SSL 证书

# SettingsPage_OnContent_00.OnContent
source: Verify normally
zh_cn: 正常校验

# SettingsPage_OffContent_00.OffContent
source: Disabled (bypass for self-signed certificates)
zh_cn: 关闭（自签名证书时可绕过）

# SettingsPage_Text_17.Text
source: Enabled games
zh_cn: 启用游戏

# SettingsPage_Text_18.Text
source: This is the default sync scope; the Sync page can override it per run.
zh_cn: 这里是默认同步范围；「同步」页可为单次任务临时改选。

# SettingsPage_Text_19.Text
source: Save
zh_cn: 保存

# SettingsPage_Text_20.Text
source: Reload
zh_cn: 重新加载

# SettingsPage_Text_21.Text
source: About and updates
zh_cn: 关于与更新

# SettingsPage_Text_22.Text
source: Current version
zh_cn: 当前版本

# SettingsPage_Text_23.Text
source: Check for updates
zh_cn: 检查更新

# SettingsPage_Text_24.Text
source: Download and install
zh_cn: 下载并更新

# SettingsPage_Header_01.Header
source: Fall back to incremental update on failure
zh_cn: 更新失败时回退增量更新

# SettingsPage_OnContent_01.OnContent
source: Only download changed files
zh_cn: 只下载变化的文件

# SettingsPage_OffContent_01.OffContent
source: Download the full package
zh_cn: 下载完整包

# SettingsPage_Text_25.Text
source: Download and install fetches the official installer, verifies its SHA256, then exits and installs silently before restarting. A portable copy is reinstalled in place; an installed copy updates its original folder. If the installer is unavailable it falls back to incremental or full-package update.
zh_cn: 点「下载并安装」会直接下载官方安装程序、校验 SHA256，然后退出本程序静默安装，装完自动启动新版本。免安装版装回当前目录保持免安装，安装版更新到原安装目录。安装程序不可用时自动回退到增量更新或完整包。

# SettingsPage_Content_00.Content
source: Open releases page
zh_cn: 打开下载页

# SyncPage_Text_00.Text
source: Sync
zh_cn: 同步

# SyncPage_Text_01.Text
source: Pick the games for this run and start. Global options such as download folder and concurrency are in Settings.
zh_cn: 选择本次要处理的游戏并启动同步；下载目录、并发等全局配置在「设置」页。

# SyncPage_Text_02.Text
source: Games for this run
zh_cn: 本次同步的游戏

# SyncPage_Text_03.Text
source: Maximum photos
zh_cn: 照片数量上限

# SyncPage_PlaceholderText_00.PlaceholderText
source: Leave empty for no limit
zh_cn: 留空表示不限制

# SyncPage_Text_04.Text
source: Start with a small number to verify your configuration.
zh_cn: 可先只处理少量照片，用来验证配置是否正确。

# SyncPage_Header_00.Header
source: Force re-download
zh_cn: 强制重新下载

# SyncPage_OnContent_00.OnContent
source: Overwrite files that already exist locally
zh_cn: 覆盖本地已存在的文件

# SyncPage_OffContent_00.OffContent
source: Skip photos that were already downloaded
zh_cn: 跳过已下载的照片

# SyncPage_Text_05.Text
source: Start sync
zh_cn: 开始同步

# SyncPage_Text_06.Text
source: Stop
zh_cn: 停止

# SyncPage_Title_00.Title
source: Operation failed
zh_cn: 操作失败

# SyncPage_Text_07.Text
source: Sync progress
zh_cn: 同步进度

# SyncPage_Text_08.Text
source: Added
zh_cn: 新增

# SyncPage_Text_09.Text
source: Skipped
zh_cn: 跳过

# SyncPage_Text_10.Text
source: Failed
zh_cn: 失败

# SyncPage_Text_11.Text
source: Sync progress
zh_cn: 同步进度

# SyncPage_Text_12.Text
source: Added
zh_cn: 新增

# SyncPage_Text_13.Text
source: Skipped
zh_cn: 跳过

# SyncPage_Text_14.Text
source: Failed
zh_cn: 失败

# SyncPage_Title_01.Title
source: Cancelling
zh_cn: 正在取消

# SyncPage_Text_15.Text
source: Failure details
zh_cn: 失败明细

# Main_Title.Text
source: Forza Gallery Sync Console
zh_cn: Forza Gallery Sync 控制台

# Main_Status_Syncing_Count.Text
source: Syncing {0}/{1}
zh_cn: 同步中 {0}/{1}

# Main_Status_Syncing.Text
source: Syncing
zh_cn: 同步中

# Main_Status_Cancelling.Text
source: Cancelling
zh_cn: 正在取消

# Main_Account_SignedIn.Text
source: Signed in
zh_cn: 已登录

# Main_Account_TokenExpired.Text
source: Token expired
zh_cn: Token 已过期

# Main_Account_NotSignedIn.Text
source: Not signed in
zh_cn: 未登录

# Dash_Hero_NoPhotos.Text
source: No photos synced yet
zh_cn: 尚未同步任何照片

# Dash_Token_NotConfigured.Text
source: Not configured
zh_cn: 未配置

# Dash_Hero_NotSynced.Text
source: No photos yet — sign in and run a sync
zh_cn: 尚未同步任何照片，先登录并执行一次同步

# Dash_Hero_Summary.Text
source: From {0} games · covering {1} months
zh_cn: 来自 {0} 个游戏 · 覆盖 {1} 个月份

# Dash_Token_Missing.Text
source: Token not configured
zh_cn: 未配置 Token

# Dash_Token_Expired.Text
source: Token expired
zh_cn: Token 已过期

# Dash_Token_Valid.Text
source: Token valid
zh_cn: Token 有效

# Dash_Card_TotalPhotos.Text
source: Total photos
zh_cn: 照片总数

# Dash_Card_CoverMonths.Text
source: Covering {0} months
zh_cn: 覆盖 {0} 个月

# Dash_Card_NoData.Text
source: No data
zh_cn: 暂无数据

# Dash_Card_SyncedGames.Text
source: Synced games
zh_cn: 已同步游戏

# Dash_Card_PendingGames.Text
source: {0} enabled games have no photos yet
zh_cn: {0} 个启用游戏还没有照片

# Dash_Card_AllGamesHavePhotos.Text
source: All enabled games have photos
zh_cn: 全部启用游戏均有照片

# Dash_Card_LastSync.Text
source: Last sync
zh_cn: 最近同步

# Dash_Card_NeverSynced.Text
source: Never synced
zh_cn: 尚未执行过同步

# Dash_Card_AccountStatus.Text
source: Account status
zh_cn: 账号状态

# Dash_Card_TokenOk.Text
source: Token works
zh_cn: Token 可正常调用接口

# Dash_Card_GoSettings.Text
source: Sign in from the Settings page
zh_cn: 前往设置页完成登录

# Dash_Sync_Fetched.Text
source: Fetched {0} · synced {1}
zh_cn: 拉取 {0} 条 · 已同步 {1} 条

# Format_Unknown.Text
source: unknown
zh_cn: 未知

# Format_HoursMinutes.Text
source: {0} h {1} min
zh_cn: {0} 小时 {1} 分

# Format_Minutes.Text
source: {0} min
zh_cn: {0} 分钟

# Gallery_Filter_All.Text
source: All
zh_cn: 全部

# Gallery_Detail_Untitled.Text
source: Untitled
zh_cn: 无标题

# Gallery_Detail_NoDescription.Text
source: No description
zh_cn: 无描述

# Gallery_Detail_Meta.Text
source: {0} · uploaded {1} · downloaded {2}
zh_cn: {0} · 上传 {1} · 下载 {2}

# Settings_Config_Saved.Text
source: Settings saved
zh_cn: 设置已保存

# Settings_Token_Refreshed.Text
source: Token refreshed
zh_cn: Token 已刷新

# Settings_Token_NotConfigured.Text
source: Not configured
zh_cn: 未配置

# Settings_Token_Expired.Text
source: Expired
zh_cn: 已过期

# Settings_Token_Valid.Text
source: Valid
zh_cn: 有效

# Update_Checking.Text
source: Checking for updates…
zh_cn: 正在检查更新…

# Update_CheckFailed.Text
source: Update check failed
zh_cn: 检查更新失败

# Update_CheckFailedDetail.Text
source: Update check failed: {0}
zh_cn: 检查更新失败：{0}

# Update_FoundNew.Text
source: New version v{0} available (current v{1})
zh_cn: 发现新版本 v{0}（当前 v{1}）

# Update_UpToDate.Text
source: Already up to date (v{0})
zh_cn: 已是最新版本（v{0}）

# Update_Preparing.Text
source: Preparing to update to {0}…
zh_cn: 正在准备更新 {0}…

# Update_IncrementalVerified.Text
source: Incremental update verified, preparing to replace…
zh_cn: 增量更新已校验，正在准备替换…

# Update_SimulateIncremental.Text
source: Simulation (incremental): {0}
zh_cn: 模拟模式（增量）：{0}

# Update_ExitingIncremental.Text
source: Exiting to finish the incremental update…
zh_cn: 即将退出并完成增量更新…

# Update_DownloadingFull.Text
source: Downloading full package {0}… {1:F0}%
zh_cn: 正在下载完整包 {0}… {1:F0}%

# Update_DownloadingFullUnknown.Text
source: Downloading full package…
zh_cn: 正在下载完整包…

# Update_SimulateBasic.Text
source: Simulation: download and hash verified; {0}
zh_cn: 模拟模式：下载与哈希已校验；{0}

# Update_FullVerified.Text
source: Download complete and hash verified, preparing to replace…
zh_cn: 下载完成，哈希校验通过，正在准备替换…

# Update_Exiting.Text
source: Exiting to finish the update…
zh_cn: 即将退出并完成更新…

# Update_Cancelled.Text
source: Download cancelled.
zh_cn: 已取消下载。

# Update_InstalledMode.Text
source: Installed build detected (recorded location: {0}); the installer will use it
zh_cn: 检测到安装版（注册表记录位置：{0}），安装程序将使用该目录

# Update_PortableMode.Text
source: Portable build detected; the installer will reinstall into {0}
zh_cn: 检测到免安装版，安装程序将装回当前目录：{0}

# Update_DownloadingInstaller.Text
source: Downloading installer {0}…
zh_cn: 正在下载安装程序 {0}…

# Update_DownloadingInstallerPct.Text
source: Downloading installer {0}… {1:F0}%
zh_cn: 正在下载安装程序 {0}… {1:F0}%

# Update_DownloadingInstallerUnknown.Text
source: Downloading installer…
zh_cn: 正在下载安装程序…

# Update_SimulateInstaller.Text
source: Simulation (installer): download and hash verified; {0}
zh_cn: 模拟模式（安装程序）：下载与哈希已校验；{0}

# Update_InstallerVerified.Text
source: Installer verified; exiting to start installation…
zh_cn: 安装程序已校验，即将退出并开始安装…

# Update_ExitingForInstall.Text
source: The app will exit to finish installing…
zh_cn: 应用即将退出并完成安装…

# Update_InstallerUnavailable.Text
source: Installer unavailable; trying another method…
zh_cn: 安装程序方式不可用，改用其他方式…

# Update_IncrementalUnavailable.Text
source: Incremental update not applicable; using the full package…
zh_cn: 增量更新不适用，改用完整包…

# Settings_Login_OpeningBrowser.Text
source: Opening the browser…
zh_cn: 正在打开浏览器…

# Sync_NoRunningTask.Text
source: No task is running
zh_cn: 当前没有运行中的任务

# Sync_FinishedAt.Text
source: Finished at {0}
zh_cn: 完成时间 {0}

# Sync_LoadingGames.Text
source: Loading the game list…
zh_cn: 正在加载游戏列表…

# Sync_NoSelection.Text
source: No games selected; the games enabled in Settings will be synced.
zh_cn: 未勾选任何游戏，将同步设置页中启用的游戏。

# Sync_Selection.Text
source: Will sync the {0} selected games.
zh_cn: 本次将同步勾选的 {0} 个游戏。

# Sync_Elapsed.Text
source: Elapsed {0}
zh_cn: 已用 {0}

# Sync_EtaEstimating.Text
source: Estimating time remaining…
zh_cn: 正在估算剩余时间…

# Sync_EtaAlmostDone.Text
source: Almost done
zh_cn: 即将完成

# Sync_EtaRemaining.Text
source: {0} remaining
zh_cn: 预计剩余 {0}

# Settings_ManualUpdate_Title.Text
source: Manual update required
zh_cn: 需要手动更新

# Settings_ManualUpdate_Body.Text
source: Cannot update automatically: {0} You can download and run the installer from the releases page.
zh_cn: 无法自动更新：{0} 可以在打开的下载页手动下载安装包并运行。

# Settings_ManualUpdate_Open.Text
source: Open releases page
zh_cn: 打开发布页

# Common_Cancel.Text
source: Cancel
zh_cn: 取消

# DashboardPage_TooltipReload.ToolTipService.ToolTip
source: Reload statistics
zh_cn: 重新加载统计

# DashboardPage_TooltipClosePreview.ToolTipService.ToolTip
source: Close preview
zh_cn: 关闭预览

# GalleryPage_TooltipBack.ToolTipService.ToolTip
source: Back to library
zh_cn: 返回照片库

# GalleryPage_TooltipRefresh.ToolTipService.ToolTip
source: Refresh
zh_cn: 刷新

# GalleryPage_TooltipOpenFolder.ToolTipService.ToolTip
source: Open the download folder in File Explorer
zh_cn: 在资源管理器中打开下载目录

# GalleryPage_TooltipPrevPage.ToolTipService.ToolTip
source: Previous page
zh_cn: 上一页

# GalleryPage_TooltipNextPage.ToolTipService.ToolTip
source: Next page
zh_cn: 下一页

# GalleryPage_TooltipToggleInfo.ToolTipService.ToolTip
source: Show / hide photo details
zh_cn: 显示 / 收起照片信息

# Upd_NoVersion.Text
source: Missing target version; cannot build the download URL.
zh_cn: 缺少目标版本号，无法构造下载地址。

# Upd_NoManifestZip.Text
source: Cannot obtain the hash manifest for v{0} (neither the hashes branch nor the Release API is reachable); refusing to install automatically for safety. Download manually from the releases page, or retry later.
zh_cn: 无法取得 v{0} 的哈希清单（hashes 分支的 {0}.txt / hashes.json 与 Release API 都不可用），为安全起见不自动安装。请到 Releases 页手动下载，或稍后重试。

# Upd_HashMismatch.Text
source: Hash verification of the update package failed; the file may be incomplete or tampered with, and has been deleted. Retry, or download manually from the releases page.
zh_cn: 更新包哈希校验失败，文件可能下载不完整或已被篡改，已删除。请重试；若反复失败请到 Releases 页手动下载。

# Upd_NoManifestInstaller.Text
source: Cannot obtain the hash manifest for {0} (neither the hashes branch nor the Release API is reachable); refusing to install automatically for safety. Download manually from the releases page, or retry later.
zh_cn: 无法取得 {0} 的哈希清单（hashes 分支清单与 Release API 都不可用），为安全起见不自动安装。请到 Releases 页手动下载，或稍后重试。

# Upd_InstallerHashMismatch.Text
source: Hash verification of the installer failed; the file may be incomplete or tampered with, and has been deleted. Retry, or download manually from the releases page.
zh_cn: 安装程序哈希校验失败，文件可能下载不完整或已被篡改，已删除。请重试；若反复失败请到 Releases 页手动下载。

# Upd_DownloadFailed.Text
source: Download failed: HTTP {0}. URL: {1}
zh_cn: 下载失败：HTTP {0}。地址：{1}

# Upd_EmptyDownload.Text
source: The downloaded file is empty.
zh_cn: 下载到的文件为空。

# Upd_NoPackage.Text
source: The update package does not exist.
zh_cn: 更新包不存在。

# Upd_EmptyPackage.Text
source: The update package is empty.
zh_cn: 更新包是空的。

# Upd_NoExeInPackage.Text
source: forza-gallery-sync.exe was not found in the update package; the wrong file may have been downloaded.
zh_cn: 更新包里找不到 forza-gallery-sync.exe，可能下载到了错误的文件。

# Upd_CorruptPackage.Text
source: The update package is corrupt or incomplete: {0}
zh_cn: 更新包已损坏或不完整：{0}

# Upd_DownloadPackageFailed.Text
source: Failed to download the update package: {0}
zh_cn: 下载更新包失败：{0}

# Upd_StartScriptFailed.Text
source: Failed to start the update script: {0}
zh_cn: 启动更新脚本失败：{0}

# Upd_StartInstallScriptFailed.Text
source: Failed to start the install script: {0}
zh_cn: 启动安装脚本失败：{0}

# Upd_BuildInstallScriptFailed.Text
source: Failed to generate the install script: {0}
zh_cn: 生成安装脚本失败：{0}

# Upd_BuildUpdateScriptFailed.Text
source: Failed to generate the update script: {0}
zh_cn: 生成更新脚本失败：{0}

# Upd_ScriptResourceMissing.Text
source: Embedded script resource {0} was not found.
zh_cn: 找不到内嵌的脚本资源 {0}。

# Upd_ScriptResourceOpenFailed.Text
source: Cannot open embedded script resource {0}.
zh_cn: 无法打开内嵌的脚本资源 {0}。

# Upd_DirNotWritable.Text
source: The program folder is not writable ({0}): {1}. Please download the update manually.
zh_cn: 程序目录不可写（{0}）：{1}。请手动下载更新包替换。

# Inc_CompareLocal.Text
source: Comparing local files…
zh_cn: 正在比对本地文件…

# Inc_CompareLocalProgress.Text
source: Comparing local files… {0}/{1}
zh_cn: 正在比对本地文件… {0}/{1}

# Inc_DownloadFile.Text
source: Downloading incremental file {0}/{1}… {2}/{3} MB
zh_cn: 正在下载增量文件 {0}/{1}… {2}/{3} MB

# Inc_DownloadSmall.Text
source: Downloading the small-files bundle ({0} files, {1} MB)…
zh_cn: 正在下载小文件包（{0} 个文件，{1} MB）…

# Inc_Packing.Text
source: Packing the incremental update…
zh_cn: 正在打包增量更新…

# Inc_NoLocalDir.Text
source: The program folder does not exist: {0}
zh_cn: 程序目录不存在：{0}

# Inc_MissingSmallFile.Text
source: A missing local file is not covered by any bundle: {0}
zh_cn: 本地缺失的小文件不在任何容器里：{0}

# Inc_EmptyAsset.Text
source: Incremental asset {0} is an empty archive
zh_cn: 增量资产 {0} 是空包

# Inc_AssetDownloadFailed.Text
source: Failed to download {0}: HTTP {1} ({2})
zh_cn: 下载 {0} 失败：HTTP {1}（{2}）

# Format_TodayTime.Text
source: Today {0}
zh_cn: 今天 {0}
